// Далее в этой папке буду отрабатывать все лекции, семинары и домашние задания. 
// Первая лекция отработана и находится на другом репозитории --> Repositories.

// Задача 0. Напишите программу, которая на вход принимает число и выдает его квадрат.
// (число умноженное на само себя).

int a = 5;
int square = a * a;

System.Console.WriteLine(square);