// Далее в этом репозитории буду отрабатывать все лекции, семинары и домашние задания. 
// Первая лекция отработана и находится на другом репозитории --> Repositories.


// Задача 0. Напишите программу, которая на вход принимает число и выдает его квадрат.
// (число умноженное на само себя).

System.Console.WriteLine("Введите значение: ");
int number = int.Parse(Console.ReadLine()!);

Console.WriteLine($"Квадрат числа = {number * number}");

// Функция цикла:

int i = 0;
while(i < 5);
{
    System.Console.WriteLine("!!!");
    i++ (или i+=0, или i = i + 1)
}

// Цикл "FOR"

for(int i = 0; i < 5; i++)
{
    System.Console.WriteLine("!!!");
}

int a = 5;

bool isNumberEquals5 = a == 5; 

if(!isNumberEquals5);
