// Семинар 7

// Задача 46. Задайте двумерный массив размером, заполненный случайными числами

Console.Clear();

// int[,] array = GetArrayRandom(3, 4);
// PrintArray(array);

// int[,] GetArrayRandom(int rows, int cols, int minValue = 0, int maxValue = 1000)
// {
//     int[,] array = new int[rows, cols];

//     var rnd = new Random();

//     for (int i = 0; i < array.GetLength(0); i++)
//     {
//         for (int j = 0; j < array.GetLength(1); j++)
//         {
//             array[i, j] = rnd.Next(minValue, maxValue + 1);
//         }
//     }
//     return array;
// }
// void PrintArray(int[,] array)
// {
//     for (int i = 0; i < array.GetLength(0); i++)
//     {
//         for (int j = 0; j < array.GetLength(1); j++)
//         {
//             Console.Write(array[i, j] + " ");
//         }
//         Console.WriteLine();
//     }
// }


// Задача 48. Задайте двумерный массив mxn, каждый элемент которого находится по формуле: A=m+n.
// Выведите полученный массив на экран.
